Healthy_Food/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
  <enumValues>
    <name>Женский</name>
  </enumValues>
</mdclass:Enum>

Healthy_Food/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Рост</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАктивности</name>
    <type>
      <types>EnumRef.ТипыАктивности</types>
    </type>
  </attributes>
</mdclass:Catalog>

Healthy_Food/src/CommonModules/ЗдоровоеПитание/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьКоличествоКалорий(Объект) Экспорт
	
	Попытка
		МассаТела = РегистрыСведений.РезультатыВзвешивания.ПолучитьВес(Объект.Ссылка);
	Исключение
		СообщениеОбОшибке = НСтр("ru = 'Не удалось получить массу тела.'");
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат 0;
		
	КонецПопытки;
	Возраст = Справочники.ФизическиеЛица.ПолучитьВозраст(Объект.Ссылка);
	КоэффициентАктивности = Перечисления.ТипыАктивности.ПолучитьКоэффициентАктивности(Объект.ТипАктивности);
	
	Если Объект.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ПоправкаНаПол = 5;
	Иначе
		ПоправкаНаПол = 0;
	КонецЕсли;
	
	Возврат (МассаТела * 10 + Объект.Рост * 100 * 6.25 - Возраст * 5 + ПоправкаНаПол) * КоэффициентАктивности;
		
КонецФункции

Функция ПолучитьКоличествоБЖУ(КоличествоКалорий) Экспорт

	Результат = Новый Структура("Белки, Жиры, Углеводы");
	Результат.Белки = КоличествоКалорий * 0.3 / 4;
	Результат.Жиры = КоличествоКалорий * 0.3 / 9;
	Результат.Углеводы = КоличествоКалорий * 0.4 / 4;

	Возврат Результат;
	
КонецФункции

#КонецОбласти
